src/cf/Documents/ОтражениеЗарплатыВУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтражениеЗарплатыВУчете</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИПРасходыНаОплатуТруда</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ИПРБП</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccumulationRegister.ИППрочиеРасходы</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУСН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисленияУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИПВидыНачисленийУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ОтражениеЗарплатыВУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(Ссылка, Отказ) Экспорт 
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетРасчетыПоОплате",ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Если НЕ УчетнаяПолитика.Существует(Выборка.Организация, Выборка.Период, Истина, Ссылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	МассивСчетовУчетаЗарплаты = Новый Массив;
	МассивСчетовУчетаЗарплаты.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	МассивСчетовУчетаЗарплаты.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДепонированнымСуммам);
	МассивСчетовУчетаЗарплаты.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
	
	Запрос.УстановитьПараметр("СводныйУчетРасчетов", БухгалтерскийУчетПереопределяемый.ВедетсяУчетРасчетовПоЗарплатеСводно());
	Запрос.УстановитьПараметр("МассивСчетовУчетаЗарплаты", МассивСчетовУчетаЗарплаты);	
	
	НомераТаблиц = Новый Структура();
	   	
	Запрос.Текст = ТекстЗапросаРеквизиты(НомераТаблиц)
		+ ТекстЗапросаОтражениеВУчете(НомераТаблиц)
		+ ТекстЗапросаОтражениеВУчетеУСН(НомераТаблиц)
		+ ТекстЗапросаОтражениеВУчетеИП(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаРеквизиты(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	КОНЕЦПЕРИОДА(Реквизиты.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПериодРегистрации
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаОтражениеВУчете(НомераТаблиц)
	НомераТаблиц.Вставить("ТаблицаОтраженияВУчете",   НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтражениеВУчете.Ссылка,
	|	ОтражениеВУчете.СчетДт,
	|	ОтражениеВУчете.СубконтоДт1,
	|	ОтражениеВУчете.СубконтоДт2,
	|	ОтражениеВУчете.СубконтоДт3,
	|	ОтражениеВУчете.СчетКт,
	|	ОтражениеВУчете.СубконтоКт1,
	|	ОтражениеВУчете.СубконтоКт2,
	|	ОтражениеВУчете.СубконтоКт3,
	|	ОтражениеВУчете.Сумма,
	|	ОтражениеВУчете.ПодразделениеДт,
	|	ОтражениеВУчете.ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетДт = &СчетРасчетыПоОплате
	|			ТОГДА ОтражениеВУчете.Сумма
	|		ИНАЧЕ ОтражениеВУчете.СуммаНУ
	|	КОНЕЦ КАК СуммаНУДт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетДт = &СчетРасчетыПоОплате
	|			ТОГДА 0
	|		ИНАЧЕ ОтражениеВУчете.СуммаПР
	|	КОНЕЦ КАК СуммаПРДт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетДт = &СчетРасчетыПоОплате
	|			ТОГДА 0
	|		ИНАЧЕ ОтражениеВУчете.СуммаВР
	|	КОНЕЦ КАК СуммаВРДт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетКт = &СчетРасчетыПоОплате
	|			ТОГДА ОтражениеВУчете.Сумма
	|		ИНАЧЕ ОтражениеВУчете.СуммаНУ
	|	КОНЕЦ КАК СуммаНУКт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетКт = &СчетРасчетыПоОплате
	|			ТОГДА 0
	|		ИНАЧЕ ОтражениеВУчете.СуммаПР
	|	КОНЕЦ КАК СуммаПРКт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетКт = &СчетРасчетыПоОплате
	|			ТОГДА 0
	|		ИНАЧЕ ОтражениеВУчете.СуммаВР
	|	КОНЕЦ КАК СуммаВРКт,
	|	ОтражениеВУчете.СчетДт.УчетПоПодразделениям КАК УчетПоПодразделениямДт,
	|	ОтражениеВУчете.СчетКт.УчетПоПодразделениям КАК УчетПоПодразделениямКт,
	|	ВЫБОР
	|		КОГДА ОтражениеВУчете.СчетКт = &СчетРасчетыПоОплате
	|			ТОГДА ""Оплата труда""
	|		ИНАЧЕ ОтражениеВУчете.СчетКт.Наименование
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете.ОтражениеВУчете КАК ОтражениеВУчете
	|ГДЕ
	|	ОтражениеВУчете.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаОтражениеВУчетеУСН(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаОтраженияВУчетеУСН",   НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтражениеВУчете.СчетДт КАК Счет,
	|	ОтражениеВУчете.СубконтоДт1 КАК Субконто1,
	|	ОтражениеВУчете.СубконтоДт2 КАК Субконто2,
	|	ОтражениеВУчете.СубконтоДт3 КАК Субконто3,
	|	ОтражениеВУчете.СчетКт КАК КорСчет,
	|	ОтражениеВУчете.СубконтоКт1 КАК КорСубконто1,
	|	ОтражениеВУчете.СубконтоКт2 КАК КорСубконто2,
	|	ОтражениеВУчете.СубконтоКт3 КАК КорСубконто3,
	|	ОтражениеВУчете.Сумма,
	|	ОтражениеВУчете.ОтражениеВУСН
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете.ОтражениеВУчете КАК ОтражениеВУчете
	|ГДЕ
	|	ОтражениеВУчете.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();	
	
КонецФункции

Функция ТекстЗапросаОтражениеВУчетеИП(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаОтраженияВУчетеИП", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтражениеВУчете.СчетДт КАК Счет,
	|	ОтражениеВУчете.СубконтоДт1 КАК Субконто1,
	|	ОтражениеВУчете.СубконтоДт2 КАК Субконто2,
	|	ОтражениеВУчете.СубконтоДт3 КАК Субконто3,
	|	ОтражениеВУчете.СчетКт КАК КорСчет,
	|	ОтражениеВУчете.СубконтоКт1 КАК КорСубконто1,
	|	ОтражениеВУчете.СубконтоКт2 КАК КорСубконто2,
	|	ОтражениеВУчете.СубконтоКт3 КАК КорСубконто3,
	|	ОтражениеВУчете.ВидНачисленияУдержания,
	|	ОтражениеВУчете.Сумма
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете.ОтражениеВУчете КАК ОтражениеВУчете
	|ГДЕ
	|	ОтражениеВУчете.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры


// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ ИБ

Процедура ЗаполнитьСуммыНалоговогоУчета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтражениеЗарплатыВУчете.Ссылка
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете КАК ОтражениеЗарплатыВУчете
	|ГДЕ
	|	ОтражениеЗарплатыВУчете.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)";
	
	ВыборкаИзРезультатовЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИзРезультатовЗапроса.Следующий() Цикл
		
		ДокументОбъект = ВыборкаИзРезультатовЗапроса.Ссылка.ПолучитьОбъект();
		
		Если ДокументОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДокумента ИЗ ДокументОбъект.ОтражениеВУчете Цикл
			
			Если СтрокаДокумента.Сумма = 0 Тогда
				Если СтрокаДокумента.СуммаНУ = 0 Тогда
					Если СтрокаДокумента.СуммаНУ + СтрокаДокумента.СуммаПР + СтрокаДокумента.СуммаВР <> 0 Тогда
						СтрокаДокумента.СуммаНУ = СтрокаДокумента.СуммаНУ - СтрокаДокумента.СуммаПР - СтрокаДокумента.СуммаВР;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если СтрокаДокумента.Сумма - СтрокаДокумента.СуммаНУ - СтрокаДокумента.СуммаПР - СтрокаДокумента.СуммаВР = СтрокаДокумента.Сумма Тогда
					СтрокаДокумента.СуммаНУ = СтрокаДокумента.Сумма;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДокументОбъект.Модифицированность() Тогда
			Попытка
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
				
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось заполнить сумму для налогового учета в документе ""Зарплата (ЗУП 2.5, ЗиК 7.7)""'"),
				УровеньЖурналаРегистрации.Ошибка, ,ВыборкаИзРезультатовЗапроса.Ссылка , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли
